12/data/attachments/a1e66655a72af65a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_2f60d643-61c0-4ce1-9600-b776e76ef1cb</nif:username>
            <nif:friendToBeAdded>Stephen_series_Friend_45343_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>